// Задача 6

Console.WriteLine("Введите пожалуйста число ^_^"); //здесь вводится число
int Number = Convert.ToInt32(Console.ReadLine());

if (Number % 2 == 0)
{
    Console.WriteLine("Да");
}
else
{
    Console.WriteLine("Нет");
}
