// Задание 10
Console.WriteLine("Введите пожалуйста число");

string Number = Console.ReadLine();

Number = Number.Substring(1, 1);

Console.WriteLine(Number);





